



List of Adjective Words
=========================

    adorable
    adventurous
    aggressive
    agreeable
    alert
    alive
    amused
    angry
    annoyed
    annoying
    anxious
    arrogant
    ashamed
    attractive
    average
    awful
    bad
    beautiful
    better
    bewildered
    black
    bloody
    blue
    blue-eyed
    blushing
    bored
    brainy
    brave
    breakable
    bright
    busy
    calm
    careful
    cautious
    charming
    cheerful
    clean
    clear
    clever
    cloudy
    clumsy
    colorful
    combative
    comfortable
    concerned
    condemned
    confused
    cooperative
    courageous
    crazy
    creepy
    crowded
    cruel
    curious
    cute
    dangerous
    dark
    dead
    defeated
    defiant
    delightful
    depressed
    determined
    different
    difficult
    disgusted
    distinct
    disturbed
    dizzy
    doubtful
    drab
    dull
    eager
    easy
    elated
    elegant
    embarrassed
    enchanting
    encouraging
    energetic
    enthusiastic
    envious
    evil
    excited
    expensive
    exuberant
    fair
    faithful
    famous
    fancy
    fantastic
    fierce
    filthy
    fine
    foolish
    fragile
    frail
    frantic
    friendly
    frightened
    funny
    gentle
    gifted
    glamorous
    gleaming
    glorious
    good
    gorgeous
    graceful
    grieving
    grotesque
    grumpy
    handsome
    happy
    healthy
    helpful
    helpless
    hilarious
    homeless
    homely
    horrible
    hungry
    hurt
    ill
    important
    impossible
    inexpensive
    innocent
    inquisitive
    itchy
    jealous
    jittery
    jolly
    joyous
    kind
    lazy
    light
    lively
    lonely
    long
    lovely
    lucky
    magnificent
    misty
    modern
    motionless
    muddy
    mushy
    mysterious
    nasty
    naughty
    nervous
    nice
    nutty
    obedient
    obnoxious
    odd
    old-fashioned
    open
    outrageous
    outstanding
    panicky
    perfect
    plain
    pleasant
    poised
    poor
    powerful
    precious
    prickly
    proud
    puzzled
    quaint
    real
    relieved
    repulsive
    rich
    scary
    selfish
    shiny
    shy
    silly
    sleepy
    smiling
    smoggy
    sore
    sparkling
    splendid
    spotless
    stormy
    strange
    stupid
    successful
    super
    talented
    tame
    tender
    tense
    terrible
    testy
    thankful
    thoughtful
    thoughtless
    tired
    tough
    troubled
    ugliest
    ugly
    uninterested
    unsightly
    unusual
    upset
    uptight
    vast
    victorious
    vivacious
    wandering
    weary
    wicked
    wide-eyed
    wild
    witty
    worrisome
    worried
    wrong
    zany
    zealous



Words Describing People

    short
    large
    fat
    thin
    thick
    blue-eyed
    brown-eyed
    green-eyed
    brunette
    blond
    smart
    intelligent
    dumb
    stupid
    hungry
    thirsty
    mean
    nice
    kind
    friendly
    honest
    truthful
    comical
    hilarious
    funny
    tall
    gorgeous
    ugly
    beautiful
    cute
    adorable
    dependable
    reliable
    dishonest
    liar
    religious
    secular
    political
    Democrat
    Republican
    Catholic
    Christian
    Lutheran
    Baptist
    Jewish
    Islamic
    pagan
    Hindu
    Buddhist
    atheist
    agnostic
    student
    teacher
    police officer
    firefighter
    doctor
    nurse
    lawyer
    dependent
    certificated financial planner
    stay at home mom
    manager
    employee
    homemaker

Words Describing Other Things (some could be used for people)

    broken
    bent
    icey
    steamy
    warm
    cold
    hot
    cool
    chilly
    breezy
    chocolatey
    spicey
    salty
    bittery
    sweet
    sour
    crunchy
    delightful
    moist
    dangerous
    exciting
    fun
    milky
    abomination
    welcoming
    open
    closed


Weather

    raining
    pouring
    snowing
    sunny
    cloudy
    hot
    cold
    warm
    cool
    freezing
    humid
    breezy
    windy
    light rain
    thunderstorm
    thunder
    lightning
    downpour
    tornado
    flood
    hurricane
    tsunami
    earthquake
    blizzard
    torrential rains


Descriptive Words For People's Bodies

    brunette
    blonde
    brown-eyed
    blue-eyed
    albino
    rosy
    heavy
    thin
    fat
    thick
    short
    tall
    muscular
    cute
    attractive
    masculine
    feminine
    pettite
    tiny
    large
    small
    pierced
    tattooed
    scarred
    painted
    polished
    Asian
    black
    African American
    white
    Caucasian
    Indian
    Spanish
    Irish
    German
    Italian
    Greek

Descriptive Words For Disposition

    happy
    moody
    sad
    tired
    angry
    grumpy
    sick
    ill
    mean
    cruel
    intelligent
    dumb
    stupified
    shocked
    angered
    excited
    aroused
    displaced

Descriptive Words For The Appearance Of Things

    dirty
    clean
    rusty
    musty
    musky
    dangerous
    hazardous
    bad
    good
    evil
    sharp
    colorful
    boring
    weird
    angled
    shaved
    carved
    painted
    unusual
    unique
    horrible
    terrifying
    scary
    calming
    peaceful
    tranquil
    organized
    disorganized
    messy
    harrowing

Other Descriptive Words For Appearance

    creepy
    fluffy
    patterned
    checkered
    circled
    encircled
    soft
    hard
    alive
    dead
    adequate
    important
    innocent
    dark
    light
    black
    white
    blue
    green
    orange
    red
    yellow
    purple
    magenta
    vicious
    violent
    adorable
    alert
    beautiful
    bright
    cloudy
    rainy
    snowy
    icey
    slippery
    glowing
    gleaming
    glamorous
    fashionable
    dowdy
    tacky
    steep
    pale
    stormy

A List of Positive Adjectives to Get You Started

Most positive adjectives are fun to say. It might be because good words have been constructed by time to describe good feelings. It might be because good feelings surround positive words regardless of how they were built. One thing's for sure: Whatever an aura is, words have them. If you read a list of negative adjectives, you'd feel differently than you would about a list of positive ones. You owe it to yourself to experiment. It only takes a few minutes, and it might meliorate your day––maybe even your life.

Heres a list of 25 words to get you started thinking positively. Change your words and change your world!

    Amazing
    Awesome
    Blithesome
    Excellent
    Fabulous
    Fantastic
    Favorable
    Fortuitous
    Great
    Incredible
    Ineffable
    Mirthful
    Outstanding
    Perfect
    Propitious
    Remarkable
    Smart
    Spectacular
    Splendid
    Stellar
    Stupendous
    Super
    Ultimate
    Unbelievable
    Wondrous


